MISC/2023-03-18-to-mr2h-memo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-18 土 00:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2023-03-18 作業依頼( Strauss )</title>
<meta name="author" content="和田勇" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">2023-03-18 作業依頼( Strauss )</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org883a7d5">1. スクリプト更新</a>
<ul>
<li><a href="#org1a199d4">1.1. 作業ディレクトリとブランチ</a></li>
<li><a href="#org2ffd4dc">1.2. git fect でリポジトリデータベース同期</a></li>
<li><a href="#org2c2f8bc">1.3. git pull で更新された情報をダウンロード</a></li>
</ul>
</li>
<li><a href="#orgfb9bb6d">2. Strauss 用 .tex ファイル生成</a>
<ul>
<li><a href="#orgd214169">2.1. 準備＆確認</a></li>
<li><a href="#org38b06de">2.2. .tex ファイル作成</a></li>
<li><a href="#orgebe2613">2.3. コンパイル</a></li>
<li><a href="#orgf9ccde5">2.4. 既知の Underfull　警告メッセージ</a></li>
</ul>
</li>
<li><a href="#orgf9a3806">3. 手動編集</a>
<ul>
<li><a href="#orgf5e3a3f">3.1. Strauss 関連ファイルを手動編集ディレクトリ EDIT へ移動 &#x2026; lyricssongs ディレクトリで &#x2026;</a></li>
<li><a href="#org93f9c7e">3.2. EDIT\Strauss ディレクトリに移動し手動編集用ブランチを作成しそこへ移動</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org883a7d5" class="outline-2">
<h2 id="org883a7d5"><span class="section-number-2">1.</span> スクリプト更新</h2>
<div class="outline-text-2" id="text-1">
<p>
&#x2026; <b>lyricssongs</b> ディレクトリで &#x2026;
</p>
</div>

<div id="outline-container-org1a199d4" class="outline-3">
<h3 id="org1a199d4"><span class="section-number-3">1.1.</span> 作業ディレクトリとブランチ</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">作業ディレクトリ</td>
<td class="org-left">lyricssongs</td>
</tr>

<tr>
<td class="org-left">ブランチ</td>
<td class="org-left">main</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org2ffd4dc" class="outline-3">
<h3 id="org2ffd4dc"><span class="section-number-3">1.2.</span> git fect でリポジトリデータベース同期</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><p>
コマンド
</p>
<div class="org-src-container">
<pre class="src src-bash">git fetch
</pre>
</div></li>

<li><p>
出力例
</p>

<pre class="example">
remote: Enumerating objects: 30, done.
remote: Counting objects: 100% (30/30), done.
remote: Compressing objects: 100% (6/6), done.
remote: Total 23 (delta 17), reused 23 (delta 17), pack-reused 0
Unpacking objects: 100% (23/23), 2.62 KiB | 16.00 KiB/s, done.
From https://github.com/128Mac/lyricssongs
   4cd9acf..743abb0  main       -&gt; origin/main
</pre></li>
</ul>
</div>
</div>

<div id="outline-container-org2c2f8bc" class="outline-3">
<h3 id="org2c2f8bc"><span class="section-number-3">1.3.</span> git pull で更新された情報をダウンロード</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><p>
コマンド
</p>
<div class="org-src-container">
<pre class="src src-bash">git pull
</pre>
</div></li>
<li><p>
出力例
</p>

<pre class="example">
Updating 4cd9acf..743abb0
Fast-forward
 scripts/21-lyricssongs-tex-gen.rb | 15 +++++++++------   ←まとめページスキップ修正
 scripts/myYomiJuman.rb            |  1 +                 ←よみ変換できない時 yomi.dict へ書き込める情報を出力
 sty/lieder-template2.tex          | 13 ++++++++++++-     ←llmk 1.2 対応
 yomi.dict                         |  1 +                 ←諷刺の歌 を登録
 4 files changed, 23 insertions(+), 7 deletions(-)
</pre></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgfb9bb6d" class="outline-2">
<h2 id="orgfb9bb6d"><span class="section-number-2">2.</span> Strauss 用 .tex ファイル生成</h2>
<div class="outline-text-2" id="text-2">
<p>
&#x2026; <b>lyricssongs</b> ディレクトリで &#x2026; Strauss ディレクトリに .tex ファイルを生成
</p>
</div>

<div id="outline-container-orgd214169" class="outline-3">
<h3 id="orgd214169"><span class="section-number-3">2.1.</span> 準備＆確認</h3>
<div class="outline-text-3" id="text-2-1">
<p>
lyricssongs に Strauss や EDIT\Strauss は <b>存在しない</b> こと
を前提としています。
</p>

<p>
存在していたら、退避などの必要な処置を講じてください。
</p>
</div>
</div>

<div id="outline-container-org38b06de" class="outline-3">
<h3 id="org38b06de"><span class="section-number-3">2.2.</span> .tex ファイル作成</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-bash">ruby scripts/21-lyricssongs-tex-gen.rb COMP/Strauss.htm
ruby scripts/21-lyricssongs-tex-gen.rb COMP/Strauss.htm
</pre>
</div>

<p>
生成される .tex ファイルをリポジトリに登録するため <b>二度</b> 実行してください。
</p>
</div>
</div>

<div id="outline-container-orgebe2613" class="outline-3">
<h3 id="orgebe2613"><span class="section-number-3">2.3.</span> コンパイル</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-bash">llmk Strauss/Strauss
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf9ccde5" class="outline-3">
<h3 id="orgf9ccde5"><span class="section-number-3">2.4.</span> 既知の Underfull　警告メッセージ</h3>
<div class="outline-text-3" id="text-2-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">ページ</th>
<th scope="col" class="org-left">Underfull とタイトル 情報</th>
<th scope="col" class="org-left">.tex ファイル</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">19</td>
<td class="org-left">ACHT GE-DICH-TE AUS ^^RLETZ-TE BL^^E4T-TER^^P</td>
<td class="org-left">Strauss-section-03.tex</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Acht Gedichte aus {\glqq}Letzte Blätter{\grqq}</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">「最後の葉」からの８つの詩</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">50</td>
<td class="org-left">BREIT' ^^FCBER MEIN HAUPT DEIN SCHWAR-ZES HAAR</td>
<td class="org-left">S2267.htm.tex</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Breit' über mein Haupt dein schwarzes Haar</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">ぼくの頭の上に広げてくれよ　おまえの黒い髪を</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">58</td>
<td class="org-left">ALL MEIN' GE-DAN-KEN, MEIN HERZ UND MEIN SINN</td>
<td class="org-left">S2139.htm.tex</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">All mein' Gedanken, mein Herz und mein Sinn</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">ぼくの考えの、心の、感覚のすべては</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">139</td>
<td class="org-left">DREI GE-S^^E4N-GE ^^E4L-TE-RER DEUT-SCHER DICH-</td>
<td class="org-left">Strauss-section-19.tex</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Drei Gesänge älterer deutscher Dichter</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">３つの古いドイツの歌</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">146</td>
<td class="org-left">F^^FCNF GE-DICH-TE VON FRIED-RICH R^^FCCK-</td>
<td class="org-left">Strauss-section-20.tex</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">Fünf Gedichte von Friedrich Rückert</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">リュッケルトの５つの詩</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgf9a3806" class="outline-2">
<h2 id="orgf9a3806"><span class="section-number-2">3.</span> 手動編集</h2>
<div class="outline-text-2" id="text-3">
<p>
lyricssongs ディレクトリで作成された Strauss.pdf をざっとみた範囲で、
問題がなければ Strauss ディレクトリを EDIT に移動し、初動編集の準備を
実施し、チェック開始＆必要に応じて直接ファイルを編集してください。
</p>
</div>

<div id="outline-container-orgf5e3a3f" class="outline-3">
<h3 id="orgf5e3a3f"><span class="section-number-3">3.1.</span> Strauss 関連ファイルを手動編集ディレクトリ EDIT へ移動 &#x2026; lyricssongs ディレクトリで &#x2026;</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><p>
コマンド
</p>
<div class="org-src-container">
<pre class="src src-bash">mv Strauss     EDIT
mv Strauss.pdf EDIT
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org93f9c7e" class="outline-3">
<h3 id="org93f9c7e"><span class="section-number-3">3.2.</span> EDIT\Strauss ディレクトリに移動し手動編集用ブランチを作成しそこへ移動</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><p>
コマンド
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #DCDCCC; font-weight: bold;">cd</span> EDIT\Strauss
git checkout -b phase-1
</pre>
</div></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 和田勇</p>
<p class="date">Created: 2023-03-18 土 00:54</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>